; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent person dron carrier num - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        (at-carrier ?c - carrier ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        ;; El dron ahora tiene un único brazo implícito
        (free ?d - dron)
        (carrying ?d - dron ?b - box)
        
        ;; Predicados para el transportador y los números
        (in-carrier ?b - box ?c - carrier)
        (boxes-in-carrier ?c - carrier ?n - num)
        (siguiente ?n1 - num ?n2 - num)
    )

    ;; Mueve solo al dron (debe tener el brazo libre)
    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (and (at-dron ?dron ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from)))
    )

    ;; Mueve al dron llevándose el transportador consigo (debe tener el brazo libre)
    (:action move-carrier
        :parameters (?from - location ?to - location ?dron - dron ?carrier - carrier)
        :precondition (and (at-dron ?dron ?from) (at-carrier ?carrier ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from)) 
                     (at-carrier ?carrier ?to) (not (at-carrier ?carrier ?from)))
    )

    ;; Recoge una caja del suelo (requiere tener el brazo libre)
    (:action pick
        :parameters (?box - box ?location - location ?dron - dron)
        :precondition (and (at-dron ?dron ?location) (at-box ?box ?location) (free ?dron))
        :effect (and (not (at-box ?box ?location)) (not (free ?dron)) (carrying ?dron ?box))
    )

    ;; Entrega una caja a una persona (el dron debe llevarla en el brazo)
    (:action leave
        :parameters (?box - box ?location - location ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location) (carrying ?dron ?box) (at-person ?person ?location) (box-has ?box ?content))
        :effect (and (at-box ?box ?location) (free ?dron) (not (carrying ?dron ?box)) 
                     (person-has ?person ?content) (not (box-has ?box ?content)))
    )

    ;; Mete una caja en el transportador (Suma 1)
    (:action put-in-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (carrying ?dron ?box) 
                           (boxes-in-carrier ?carrier ?n1) (siguiente ?n1 ?n2))
        :effect (and (not (carrying ?dron ?box)) (free ?dron) (in-carrier ?box ?carrier) 
                     (not (boxes-in-carrier ?carrier ?n1)) (boxes-in-carrier ?carrier ?n2))
    )

    ;; Saca una caja del transportador (Resta 1)
    (:action take-from-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (free ?dron) (in-carrier ?box ?carrier) 
                           (boxes-in-carrier ?carrier ?n2) (siguiente ?n1 ?n2))
        :effect (and (carrying ?dron ?box) (not (free ?dron)) (not (in-carrier ?box ?carrier)) 
                     (not (boxes-in-carrier ?carrier ?n2)) (boxes-in-carrier ?carrier ?n1))
    )
)

; problem
(define (problem problem_size1)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 - location
	box1 - box
	comida medicina - bcontent
	person1 - person
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-dron dron1 deposito)
	(free dron1)
	(at-carrier carrier1 deposito)
	(boxes-in-carrier carrier1 n0)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-person person1 refugio1)
)

(:goal (and
	(person-has person1 comida)
))
)

; plan
1. (pick box1 deposito dron1)
   deleted: (at-box box1 deposito) (free dron1)
   added: (carrying dron1 box1)
   goals met: 0 of 1
2. (put-in-carrier box1 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 0 of 1
3. (move-carrier deposito refugio1 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio1) (at-carrier carrier1 refugio1)
   goals met: 0 of 1
4. (take-from-carrier box1 refugio1 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box1) (boxes-in-carrier carrier1 n0)
   goals met: 0 of 1
5. (leave box1 refugio1 dron1 person1 comida)
   deleted: (carrying dron1 box1) (box-has box1 comida)
   added: (at-box box1 refugio1) (free dron1) (person-has person1 comida)
   goals met: 1 of 1
